Documents/РеклассификацияАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РеклассификацияАктивовЕПС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переоценивать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПроцентныеПоказатели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиЦеныДляПереоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьПартииБезИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтноситьПереоценкуНаАктивыВДУ03</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДооценкиКупона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаЭСПРазницаППРезервВПереоценку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйАктивЕПССтарый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Партии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переоценка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереоценкаВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтПремия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтПремияНачисленный</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтПремияНачисленныйВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировкаЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировкаЭСПВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДооценкаПоПрофсуждению</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДооценкаПоПрофсуждениюВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДооценкаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДооценкаКупонаВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначислениеДисконтаПремии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначислениеДисконтаПремииВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначислениеКорректировкиЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначислениеКорректировкиЭСПВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначислениеРазницаПервоначальногоПризнания</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезервовПодОбесценение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПокупки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтПремияПокупки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьКупонаВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереоценкаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереоценкаКупонаВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСделки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеклассификацияАктивовЕПС/Ext/ManagerModule.bsl
Функция ПолучитьДанныеРеклассификаций(НачалоПериода, ОкончаниеПериода, Организация, СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеклассификацияАктивовЕПС.Ссылка КАК Ссылка,
		|	РеклассификацияАктивовЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РеклассификацияАктивовЕПС.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	РеклассификацияАктивовЕПС.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПСРодитель,
		|	РеклассификацияАктивовЕПС.КорректировкаЭСПРазницаППРезервВПереоценку КАК КорректировкаЭСПРазницаППРезервВПереоценку,
		|	РеклассификацияАктивовЕПСПартии.Партия КАК Партия,
		|	РеклассификацияАктивовЕПСПартии.СтрокаПартии КАК СтрокаПартии,
		|	РеклассификацияАктивовЕПСПартии.Количество КАК Количество,
		|	РеклассификацияАктивовЕПСПартии.Стоимость КАК Стоимость,
		|	РеклассификацияАктивовЕПСПартии.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.Переоценка КАК Переоценка,
		|	РеклассификацияАктивовЕПСПартии.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремия КАК ДисконтПремия,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.КорректировкаЭСП КАК КорректировкаЭСП,
		|	РеклассификацияАктивовЕПСПартии.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаПоПрофсуждению КАК ДооценкаПоПрофсуждению,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаПоПрофсуждениюВВалютеУчета КАК ДооценкаПоПрофсуждениюВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаКупона КАК ДооценкаКупона,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаКупонаВВалютеУчета КАК ДооценкаКупонаВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеДисконтаПремии КАК ДоначислениеДисконтаПремии,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеДисконтаПремииВВалютеУчета КАК ДоначислениеДисконтаПремииВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеКорректировкиЭСП КАК ДоначислениеКорректировкиЭСП,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеКорректировкиЭСПВВалютеУчета КАК ДоначислениеКорректировкиЭСПВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеРазницаПервоначальногоПризнания КАК ДоначислениеРазницаПервоначальногоПризнания,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета КАК ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение
		|ИЗ
		|	Документ.РеклассификацияАктивовЕПС КАК РеклассификацияАктивовЕПС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО (РеклассификацияАктивовЕПСПартии.Ссылка = РеклассификацияАктивовЕПС.Ссылка)
		|			И (РеклассификацияАктивовЕПС.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			И (РеклассификацияАктивовЕПС.Организация = &Организация)
		|			И (РеклассификацияАктивовЕПС.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (РеклассификацияАктивовЕПС.Проведен)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
